memtier/performance/data/memorix/all-6.out
12        Threads
50        Connections per thread
100       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets        16514.63          ---          ---         3.34846         3.16700         6.68700         7.67900        14.01500      1127.02 
Gets       165115.56        23.34    165092.22         3.29677         3.11900         6.62300         7.35900        13.31100      4175.72 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals     181630.19        23.34    165092.22         3.30147         3.11900         6.62300         7.39100        13.37500      5302.74 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.335        0.000
SET       2.783        5.000
SET       2.879       10.000
SET       2.943       15.000
SET       2.975       20.000
SET       3.023       25.000
SET       3.055       30.000
SET       3.071       35.000
SET       3.103       40.000
SET       3.135       45.000
SET       3.167       50.000
SET       3.167       52.500
SET       3.183       55.000
SET       3.199       57.500
SET       3.215       60.000
SET       3.231       62.500
SET       3.247       65.000
SET       3.263       67.500
SET       3.279       70.000
SET       3.295       72.500
SET       3.327       75.000
SET       3.327       76.250
SET       3.343       77.500
SET       3.359       78.750
SET       3.375       80.000
SET       3.375       81.250
SET       3.391       82.500
SET       3.407       83.750
SET       3.439       85.000
SET       3.455       86.250
SET       3.487       87.500
SET       3.503       88.125
SET       3.519       88.750
SET       3.535       89.375
SET       3.567       90.000
SET       3.599       90.625
SET       3.647       91.250
SET       3.711       91.875
SET       3.807       92.500
SET       4.015       93.125
SET       4.703       93.750
SET       5.183       94.062
SET       5.439       94.375
SET       5.599       94.688
SET       5.695       95.000
SET       5.791       95.312
SET       5.855       95.625
SET       5.951       95.938
SET       6.015       96.250
SET       6.047       96.562
SET       6.111       96.875
SET       6.143       97.031
SET       6.175       97.188
SET       6.207       97.344
SET       6.239       97.500
SET       6.271       97.656
SET       6.303       97.812
SET       6.335       97.969
SET       6.399       98.125
SET       6.431       98.281
SET       6.463       98.438
SET       6.495       98.516
SET       6.527       98.594
SET       6.559       98.672
SET       6.559       98.750
SET       6.591       98.828
SET       6.655       98.906
SET       6.687       98.984
SET       6.719       99.062
SET       6.783       99.141
SET       6.847       99.219
SET       6.911       99.258
SET       6.943       99.297
SET       7.039       99.336
SET       7.103       99.375
SET       7.231       99.414
SET       7.391       99.453
SET       7.615       99.492
SET       7.935       99.531
SET       8.319       99.570
SET       8.767       99.609
SET       9.023       99.629
SET       9.279       99.648
SET       9.535       99.668
SET       9.791       99.688
SET      10.047       99.707
SET      10.303       99.727
SET      10.559       99.746
SET      10.815       99.766
SET      11.071       99.785
SET      11.391       99.805
SET      11.583       99.814
SET      11.775       99.824
SET      11.967       99.834
SET      12.159       99.844
SET      12.351       99.854
SET      12.671       99.863
SET      12.991       99.873
SET      13.311       99.883
SET      13.695       99.893
SET      14.143       99.902
SET      14.335       99.907
SET      14.655       99.912
SET      14.975       99.917
SET      15.295       99.922
SET      15.615       99.927
SET      16.063       99.932
SET      16.639       99.937
SET      17.023       99.941
SET      17.407       99.946
SET      17.919       99.951
SET      18.175       99.954
SET      18.431       99.956
SET      18.687       99.958
SET      18.943       99.961
SET      19.199       99.963
SET      19.583       99.966
SET      20.095       99.968
SET      20.735       99.971
SET      21.119       99.973
SET      21.631       99.976
SET      21.887       99.977
SET      22.143       99.978
SET      22.527       99.979
SET      22.655       99.980
SET      22.911       99.982
SET      23.167       99.983
SET      23.423       99.984
SET      23.807       99.985
SET      24.063       99.987
SET      24.447       99.988
SET      24.575       99.988
SET      24.831       99.989
SET      25.087       99.990
SET      25.343       99.990
SET      25.599       99.991
SET      25.855       99.991
SET      25.983       99.992
SET      26.239       99.993
SET      26.367       99.993
SET      26.623       99.994
SET      26.751       99.994
SET      26.879       99.995
SET      27.007       99.995
SET      27.135       99.995
SET      27.263       99.995
SET      27.519       99.996
SET      27.647       99.996
SET      27.775       99.996
SET      27.775       99.997
SET      28.159       99.997
SET      28.287       99.997
SET      28.415       99.997
SET      28.415       99.997
SET      28.671       99.998
SET      28.799       99.998
SET      28.927       99.998
SET      29.183       99.998
SET      29.439       99.998
SET      29.567       99.998
SET      29.695       99.998
SET      30.335       99.999
SET      30.463       99.999
SET      30.463       99.999
SET      30.591       99.999
SET      30.591       99.999
SET      30.591       99.999
SET      30.719       99.999
SET      30.847       99.999
SET      31.359       99.999
SET      31.487       99.999
SET      31.487       99.999
SET      31.487       99.999
SET      31.743       99.999
SET      31.743       99.999
SET      31.871       99.999
SET      31.999       99.999
SET      31.999      100.000
SET      32.127      100.000
SET      32.383      100.000
SET      32.383      100.000
SET      32.383      100.000
[...]
SET      33.535      100.000
SET      33.535      100.000
SET      33.535      100.000
SET      33.791      100.000
SET      33.791      100.000
SET      33.791      100.000
[...]
SET      34.815      100.000
SET      34.815      100.000
SET      34.815      100.000
[...]
SET      35.839      100.000
SET      35.839      100.000
---
GET       0.199        0.000
GET       2.751        5.000
GET       2.847       10.000
GET       2.895       15.000
GET       2.943       20.000
GET       2.975       25.000
GET       3.007       30.000
GET       3.039       35.000
GET       3.055       40.000
GET       3.087       45.000
GET       3.119       50.000
GET       3.135       52.500
GET       3.151       55.000
GET       3.151       57.500
GET       3.167       60.000
GET       3.183       62.500
GET       3.199       65.000
GET       3.215       67.500
GET       3.231       70.000
GET       3.247       72.500
GET       3.279       75.000
GET       3.279       76.250
GET       3.295       77.500
GET       3.311       78.750
GET       3.311       80.000
GET       3.327       81.250
GET       3.343       82.500
GET       3.359       83.750
GET       3.375       85.000
GET       3.407       86.250
GET       3.423       87.500
GET       3.439       88.125
GET       3.455       88.750
GET       3.471       89.375
GET       3.503       90.000
GET       3.535       90.625
GET       3.567       91.250
GET       3.631       91.875
GET       3.711       92.500
GET       3.855       93.125
GET       4.415       93.750
GET       5.023       94.062
GET       5.343       94.375
GET       5.535       94.688
GET       5.631       95.000
GET       5.727       95.312
GET       5.823       95.625
GET       5.887       95.938
GET       5.951       96.250
GET       6.015       96.562
GET       6.079       96.875
GET       6.111       97.031
GET       6.111       97.188
GET       6.143       97.344
GET       6.175       97.500
GET       6.207       97.656
GET       6.239       97.812
GET       6.303       97.969
GET       6.335       98.125
GET       6.367       98.281
GET       6.399       98.438
GET       6.431       98.516
GET       6.463       98.594
GET       6.495       98.672
GET       6.495       98.750
GET       6.527       98.828
GET       6.559       98.906
GET       6.623       98.984
GET       6.655       99.062
GET       6.687       99.141
GET       6.751       99.219
GET       6.815       99.258
GET       6.847       99.297
GET       6.911       99.336
GET       6.975       99.375
GET       7.071       99.414
GET       7.167       99.453
GET       7.327       99.492
GET       7.551       99.531
GET       7.871       99.570
GET       8.319       99.609
GET       8.575       99.629
GET       8.831       99.648
GET       9.087       99.668
GET       9.343       99.688
GET       9.599       99.707
GET       9.855       99.727
GET      10.111       99.746
GET      10.431       99.766
GET      10.687       99.785
GET      11.007       99.805
GET      11.135       99.814
GET      11.327       99.824
GET      11.519       99.834
GET      11.711       99.844
GET      11.903       99.854
GET      12.159       99.863
GET      12.415       99.873
GET      12.671       99.883
GET      12.991       99.893
GET      13.375       99.902
GET      13.631       99.907
GET      13.887       99.912
GET      14.079       99.917
GET      14.399       99.922
GET      14.783       99.927
GET      15.167       99.932
GET      15.551       99.937
GET      15.999       99.941
GET      16.639       99.946
GET      17.151       99.951
GET      17.407       99.954
GET      17.791       99.956
GET      18.047       99.958
GET      18.431       99.961
GET      18.815       99.963
GET      19.199       99.966
GET      19.583       99.968
GET      20.095       99.971
GET      20.479       99.973
GET      21.119       99.976
GET      21.375       99.977
GET      21.631       99.978
GET      21.887       99.979
GET      22.143       99.980
GET      22.527       99.982
GET      22.783       99.983
GET      23.039       99.984
GET      23.423       99.985
GET      23.679       99.987
GET      24.063       99.988
GET      24.319       99.988
GET      24.447       99.989
GET      24.703       99.990
GET      24.959       99.990
GET      25.087       99.991
GET      25.343       99.991
GET      25.599       99.992
GET      25.727       99.993
GET      25.983       99.993
GET      26.239       99.994
GET      26.367       99.994
GET      26.495       99.995
GET      26.623       99.995
GET      26.879       99.995
GET      27.007       99.995
GET      27.263       99.996
GET      27.391       99.996
GET      27.519       99.996
GET      27.775       99.997
GET      27.903       99.997
GET      28.031       99.997
GET      28.287       99.997
GET      28.415       99.997
GET      28.543       99.998
GET      28.671       99.998
GET      28.799       99.998
GET      29.055       99.998
GET      29.183       99.998
GET      29.439       99.998
GET      29.567       99.998
GET      29.695       99.999
GET      29.951       99.999
GET      29.951       99.999
GET      30.207       99.999
GET      30.591       99.999
GET      30.719       99.999
GET      30.975       99.999
GET      31.231       99.999
GET      31.359       99.999
GET      31.615       99.999
GET      31.871       99.999
GET      31.999       99.999
GET      31.999       99.999
GET      32.255       99.999
GET      32.255       99.999
GET      32.383       99.999
GET      32.383      100.000
GET      32.383      100.000
GET      32.511      100.000
GET      32.511      100.000
GET      32.767      100.000
GET      32.767      100.000
GET      33.023      100.000
GET      33.023      100.000
GET      33.023      100.000
GET      33.279      100.000
GET      33.535      100.000
GET      33.535      100.000
GET      33.791      100.000
GET      33.791      100.000
GET      33.791      100.000
GET      34.047      100.000
GET      34.047      100.000
GET      34.047      100.000
GET      34.303      100.000
GET      34.815      100.000
GET      34.815      100.000
GET      34.815      100.000
GET      35.071      100.000
GET      35.071      100.000
GET      35.327      100.000
GET      35.327      100.000
GET      35.327      100.000
GET      35.583      100.000
GET      35.583      100.000
GET      35.583      100.000
GET      35.839      100.000
GET      35.839      100.000
GET      36.095      100.000
GET      36.607      100.000
GET      36.607      100.000
GET      36.607      100.000
GET      36.863      100.000
GET      36.863      100.000
GET      36.863      100.000
[...]
GET      37.119      100.000
GET      37.119      100.000
GET      37.375      100.000
GET      37.375      100.000
GET      37.375      100.000
[...]
GET      37.631      100.000
GET      37.631      100.000
GET      37.631      100.000
[...]
GET      37.887      100.000
GET      37.887      100.000
GET      37.887      100.000
[...]
GET      38.143      100.000
GET      38.143      100.000
---
WAIT      0.000      100.000